# -*- coding=utf-8 -*-

NODES = [
    # {"host": "192.168.1.42", "port": 5571},
    {"host": "192.168.1.102", "port": 9500},
    {"host": "192.168.1.103", "port": 9500},
    {"host": "192.168.1.104", "port": 9500},
    {"host": "192.168.1.105", "port": 9500},
    {"host": "192.168.1.106", "port": 9500},
    {"host": "192.168.1.107", "port": 9500},
    ]

EXLUDE_CHAR = frozenset(['(', ')', '（', '）', '.'])

STYLE = {
    #old style
    u'潮男': u'男模明星',
    u'hi潮男': u'男模明星',
    # new style
    u'欧美': u'欧美', u'日韩': u'日韩', u'本土': u'本土', u'热播': u'热播',
    u'型男': u'型男', u'复古': u'复古', u'轻熟': u'轻熟', u'OL': u'OL',
    u'清新': u'清新', u'混搭': u'混搭', u'甜美': u'甜美', u'街头': u'街头',
    u'闺蜜': u'闺蜜', u'休闲': u'休闲', u'摩登': u'摩登',
    # scene
    u'逛街': u'逛街', u'约会': u'约会', u'派对': u'派对', u'运动': u'运动',
    u'出游': u'出游', u'典礼': u'典礼',
    # shape
    u'高挑': u'高挑', u'娇小': u'娇小', u'丰满': u'丰满',
}

# sku side bar category mapping
CLASSIFY = {
    u'潮男': u'男',  u'包包': u'包', u'衣服': u'衣服', u'裙子': u'裙',
    u'裤子': u'裤子', u'鞋子': u'鞋', u'配饰': '配饰', u'美妆': u'美妆',
    u'格物': u'格物', u'最热': ''
    }

SKU_TYPE = frozenset([
    u"外套", u"上衣", u"裤子", u"裙子", u"连衣裙", u"鞋", u"包", u"配饰", u"套装", u"大衣",
    u"雪纺衫", u"风衣", u"西服", u"西装", u"夹克", u"棒球夹克", u"棉服", u"羽绒服", u"马夹",
    u"马甲", u"皮衣", u"斗篷", u"披肩", u"毛衣", u"衬衫", u"衬衣", u"针织衫", u"T恤", u"卫衣",
    u"背心", u"吊带", u"娃娃衫", u"打底衫", u"假两件", u"开衫", u"套头衫", u"罩衫", u"牛仔裤",
    u"直筒裤", u"喇叭裤", u"铅笔裤", u"小脚裤", u"牛仔短裤", u"哈伦裤", u"胯裆裤", u"灯笼裤",
    u"紧身裤", u"修身裤", u"阔腿裤", u"打底裤", u"皮裤", u"运动裤", u"裤裙", u"裙裤", u"西裤",
    u"背带裤", u"短裤", u"热裤", u"连体裤", u"连衣裤", u"连身裤", u"九分裤", u"七分裤",
    u"休闲裤", u"一步裙", u"牛仔裙", u"包臀裙", u"铅笔裙", u"花苞裙", u"蛋糕裙", u"A字裙",
    u"伞裙", u"蓬蓬裙", u"中裙", u"百褶裙", u"吊带裙", u"背心裙", u"毛衣裙", u"抹胸裙",
    u"抹胸", u"裹胸裙", u"衬衫裙", u"背带裙", u"紧身裙", u"修身裙", u"挂脖裙", u"绕脖裙",
    u"公主裙", u"半身裙", u"T恤裙", u"帆布鞋", u"牛津鞋", u"布洛克鞋", u"雕花鞋", u"运动鞋",
    u"乐福鞋", u"尖头鞋", u"坡跟鞋", u"单鞋", u"平底鞋", u"豆豆鞋", u"刺猬鞋", u"防狼鞋",
    u"松糕鞋", u"人字拖", u"拖鞋", u"玛丽珍鞋", u"罗马鞋", u"凉鞋", u"系带鞋", u"鱼嘴鞋",
    u"懒人鞋", u"马丁鞋", u"休闲鞋", u"皮鞋", u"高跟鞋", u"五分裤", u"中裤", u"靴子",
    u"马丁靴", u"机车靴", u"雪地靴", u"罗马靴", u"翻毛靴", u"蝙蝠包", u"笑脸包", u"囧字包",
    u"医生包", u"邮差包", u"手提包", u"单肩包", u"斜挎包", u"链条包", u"铂金包", u"秋千包",
    u"手拿包", u"手包", u"手抓包", u"麦昆包", u"戴妃包", u"双肩包", u"剑桥包", u"信封包",
    u"水桶包", u"圆筒包", u"机车包", u"晚宴包", u"晚礼包", u"宴会包", u"贝壳包", u"马鞍包",
    u"饺子包", u"钱包", u"枕头包", u"项链", u"领带", u"背带", u"假领", u"机车帽", u"手链",
    u"手镯", u"颈圈", u"项圈", u"耳钉", u"耳环", u"手套", u"围巾", u"丝巾", u"围脖", u"戒指",
    u"镜框", u"太阳镜", u"墨镜", u"帽子", u"礼帽", u"遮阳帽", u"鸭舌帽", u"棒球帽", u"大檐帽",
    u"针织帽", u"平沿帽", u"发带", u"发箍", u"手表", u"袜子", u"裤袜", u"连体袜", u"打底袜",
    u"袜套", u"堆堆袜", u"丝袜", u"腰带", u"细腰带", u"腰封", u"宽腰封", u"胸针", u"两件套",
    u"三件套", u"短靴", u"雪纺裙", u"毛衣链", u"嘻哈帽", u"街舞帽", u"蝙蝠衫", u"高帮鞋",
    u"皮裙", u"发饰", u"头饰", u"头花", u"毛衣外套", u"皮草", u"增高鞋", u"超短裤", u"三角裤",
    u"八角帽", u"发夹", u"波士顿包", u"嘻哈裤", u"披风", u"公文包", u"盆帽", u"棒球服",
    u"头箍", u"方巾", u"两件", u"太阳帽", u"发簪", u"帽衫", u"大沿帽", u"一脚蹬", u"画家帽",
    u"簪子", u"牛仔夹克", u"文胸", u"袜裤", u"平顶帽", u"多用包", u"皮衣夹克", u"胸衣",
    u"水饺包", u"渔夫帽", u"低档裤", u"飞行夹克", u"坎肩", u"宽檐帽", u"甩脚裤", u"手环",
    u"皇冠", u"浅口鞋", u"裹胸", u"背包", u"护耳罩", u"平跟鞋", u"毛衣项链", u"雷锋帽",
    u"踝靴", u"双用包", u"护耳帽", u"平檐帽", u"宽沿帽", u"钱夹", u"超短裙", u"卷边帽",
    u"头绳", u"吊裆裤", u"机车夹克", u"冲锋衣", u"指环", u"棉衣", u"亚克力包", u"及踝靴",
    u"迷你裙", u"注压鞋", u"硫化鞋", u"缝制鞋", u"胶粘鞋", u"短裙", u"迷你超短裙", u"长裙",
    u"流苏靴", u"骑士靴", u"迷你包", u"Polo衫", u"工装鞋", u"南丁格尔包", u"盒形包",
    u"杀手包", u"棉袜", u"过膝长靴", u"凯莉包", u"皮帽", u"娃娃鞋", u"蛤蟆镜", u"摇摇鞋",
    u"太子镜", u"工装靴", u"多用帽", u"箱型包", u"娃娃裙", u"尾戒", u"长筒袜", u"短袜",
    u"无顶帽", u"马术帽", u"中筒袜", u"尖尖帽", u"贝蕾帽", u"帆船鞋", u"腰包", u"A裙",
    u"毡帽", u"琳迪包", u"高筒袜", u"中长裙", u"鱼尾裙", u"恶魔帽", u"菱格包", u"耳罩",
    u"超长裙", u"船袜", u"雨靴", u"潘多拉盒子", u"草帽", u"运动衫", u"乞丐裤"
])
